src/cf/Enums/ТипыСтрокПлана.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыСтрокПлана</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сотрудник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Группировка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/ПланированиеКлиентСервер/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Заполняет представление периодов в списке выбора с учетом склонения в зависимости от количества периодов
//
// Параметры:
//  СписокВыбора        - СписокЗначений - список, содержащий периоды.
//  КоличествоПериодов  - Число - выбранное пользователем количество периодов
//
Процедура ЗаполнитьПредставлениеЗначенийСпискаВыбораПериодаВЗависимостиОтКоличестваПериодов(СписокВыбора, КоличествоПериодов) Экспорт
	
	Для Каждого ЭлементСписка Из СписокВыбора Цикл
		
		ЭлементСписка.Представление = ПредставлениеПеридичностиВЗависимостиОтКоличестваПериодов(ЭлементСписка.Значение, КоличествоПериодов);
		
	КонецЦикла;
	
КонецПроцедуры

// Определяет представление периода с учетом склонения в зависимости от количества периодов
//
// Параметры:
//  Периодичность       - ПеричислениеСсылка.ПериодичностьПланов - период, представление которого определяется.
//  КоличествоПериодов  - Число
//
Функция ПредставлениеПеридичностиВЗависимостиОтКоличестваПериодов(Периодичность, КоличествоПериодов)  Экспорт
	
	Представление = "";
	
	Если Периодичность = ПредопределенноеЗначение("Перечисление.ПериодичностьПланов.Год") Тогда
		
		Если КоличествоПериодов = 1 Тогда
			Представление = НСтр("ru = 'год'");
		ИначеЕсли КоличествоПериодов > 1 
			И  КоличествоПериодов < 5 Тогда
			Представление = НСтр("ru = 'года'");
		Иначе
			Представление = НСтр("ru = 'лет'");
		КонецЕсли;
		
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.ПериодичностьПланов.День") Тогда
		
		Если КоличествоПериодов = 1 Тогда
			Представление = НСтр("ru = 'день'");
		ИначеЕсли КоличествоПериодов > 1 
			И  КоличествоПериодов < 5 Тогда
			Представление = НСтр("ru = 'дня'");
		Иначе
			Представление = НСтр("ru = 'дней'");
		КонецЕсли;
		
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.ПериодичностьПланов.Квартал") Тогда
		
		Если КоличествоПериодов = 1 Тогда
			Представление = НСтр("ru = 'квартал'");
		ИначеЕсли КоличествоПериодов > 1 
			И  КоличествоПериодов < 5 Тогда
			Представление = НСтр("ru = 'квартала'");
		Иначе
			Представление = НСтр("ru = 'кварталов'");
		КонецЕсли;
		
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.ПериодичностьПланов.Месяц") Тогда
		
		Если КоличествоПериодов = 1 Тогда
			Представление = НСтр("ru = 'месяц'");
		ИначеЕсли КоличествоПериодов > 1 
			И  КоличествоПериодов < 5 Тогда
			Представление = НСтр("ru = 'месяца'");
		Иначе
			Представление = НСтр("ru = 'месяцев'");
		КонецЕсли;
		
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.ПериодичностьПланов.Неделя") Тогда
		
		Если КоличествоПериодов = 1 Тогда
			Представление = НСтр("ru = 'неделя'");
		ИначеЕсли КоличествоПериодов > 1 
			И  КоличествоПериодов < 5 Тогда
			Представление = НСтр("ru = 'недели'");
		Иначе
			Представление = НСтр("ru = 'недель'");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

// Ищет строку по значению в заданной колонке дерева
//
// Параметры:
//  ГдеИскать           - ДанныеФормыДерево, ДанныеФормыЭлементДерева - .
//  Колонка             - Строка
//  Значение            - Произвольный
//  ИскатьВПодчиненных  - Булево
//
// Возвращаемое значение:
//   ДанныеФормыЭлементДерева, Неопределено
//
Функция НайденнаяСтрокаВДанныхФормыДерево(ГдеИскать,Колонка, Значение, ИскатьВПодчиненных) Экспорт
	
	ЭлементыДерева = ГдеИскать.ПолучитьЭлементы();
	
	Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
		
		Если ЭлементДерева[Колонка] = Значение Тогда
			
			Возврат ЭлементДерева;
			
		ИначеЕсли ИскатьВПодчиненных Тогда
			
			НайденнаяСтрока = НайденнаяСтрокаВДанныхФормыДерево(ЭлементДерева, Колонка , Значение, ИскатьВПодчиненных);
			Если НайденнаяСтрока <> Неопределено Тогда
				Возврат НайденнаяСтрока;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

// Конструктор структуры, содержащей данные периода плана.
//
// Возвращаемое значение:
//   Структура - содержит:
//     * ДатаНачала    - Дата
//     * ДатаОкончания - Дата
//
Функция НовыйПериодПлана() Экспорт
	
	ПериодПлана = Новый Структура;
	ПериодПлана.Вставить("ДатаНачала", Дата(1,1,1));
	ПериодПлана.Вставить("ДатаОкончания", Дата(1,1,1));
	
	Возврат ПериодПлана;
	
КонецФункции

// Конструктор структуры, содержащей данные зап плана.
//
// Возвращаемое значение:
//   Структура - содержит:
//   * ИдентификаторПлана - Число
//   * Сотрудник          - СправочникСсылка.Пользователи
//   * Работа             - СправочникСсылка.ЗадачиПроцессов, СправочникСсылка.ТехническиеПроекты, СправочникСсылка.Ошибки, СправочникСсылка.ВидыДеятельности
//   * ПланируемыеТрудозатраты - Число
//   * Цель                    - Строка
//   * Достигнуто              - Строка
//   * Комментарий             - Строка
//   * ПеренестиВСледующийПлан - Булево
//   * Результат - Булево      - Перечисление.РезультатыВыполненияПланируемыхРабот
//
Функция НовыйДанныеЗаписиПлана() Экспорт
	
	ДанныеЗаписиПлана = Новый Структура;
	ДанныеЗаписиПлана.Вставить("ИдентификаторПлана",      0);
	ДанныеЗаписиПлана.Вставить("Сотрудник",               ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка"));
	ДанныеЗаписиПлана.Вставить("Работа",                  Неопределено);
	ДанныеЗаписиПлана.Вставить("ТипСтрокиПлана",          ПредопределенноеЗначение("Перечисление.ТипыСтрокПлана.ПустаяСсылка"));
	ДанныеЗаписиПлана.Вставить("Группировка",             Неопределено);
	ДанныеЗаписиПлана.Вставить("ПланируемыеТрудозатраты", 0);
	ДанныеЗаписиПлана.Вставить("Цель",                    "");
	ДанныеЗаписиПлана.Вставить("Достигнуто",              "");
	ДанныеЗаписиПлана.Вставить("Комментарий",             "");
	ДанныеЗаписиПлана.Вставить("ПеренестиВСледующийПлан", Ложь);
	ДанныеЗаписиПлана.Вставить("Результат",               ПредопределенноеЗначение("Перечисление.РезультатыВыполненияПланируемыхРабот.ПустаяСсылка"));
	ДанныеЗаписиПлана.Вставить("Удалить",                 Ложь);
	
	Возврат ДанныеЗаписиПлана;
	
КонецФункции

// Формирует список плановых работы, по которым согласуются трудозатраты.
//
// Возвращаемое значение:
//   СписокЗначений
//
Функция СписокТиповРаботПоКоторымСогласуютсяТрудозатраты() Экспорт
	
	СписокТиповРабот = Новый СписокЗначений;
	СписокТиповРабот.Добавить(Тип("СправочникСсылка.ЗадачиПроцесса"));
	СписокТиповРабот.Добавить(Тип("СправочникСсылка.ТехническиеПроекты"));
	
	Возврат СписокТиповРабот;
	
КонецФункции

// Формирует массив типов работ, у которых есть статусы и даты.
//
// Возвращаемое значение:
//   Массив
//
Функция ТипыРаботСоСтатусамиДатами() Экспорт
	
	МассивТиповРабот = Новый Массив;
	МассивТиповРабот.Добавить(Тип("СправочникСсылка.ЗадачиПроцесса"));
	МассивТиповРабот.Добавить(Тип("СправочникСсылка.ТехническиеПроекты"));
	МассивТиповРабот.Добавить(Тип("СправочникСсылка.Ошибки"));
	
	Возврат МассивТиповРабот;
	
КонецФункции

// Формирует список значений всех типов работ планирования.
//
// Возвращаемое значение:
//   СписокЗначений
//
Функция ВсеТипыРабот() Экспорт
	
	СписокРабот = Новый СписокЗначений;
	СписокРабот.Добавить(Тип("СправочникСсылка.ЗадачиПроцесса"));
	СписокРабот.Добавить(Тип("СправочникСсылка.ТехническиеПроекты"));
	СписокРабот.Добавить(Тип("СправочникСсылка.Ошибки"));
	СписокРабот.Добавить(Тип("СправочникСсылка.ВидыДеятельности"));
	
	Возврат СписокРабот;
	
КонецФункции

// Переводит секунды в часы
//
// Параметры:
//  Секунды - Число - количество секунд.
//
// Возвращаемое значение:
//   Число
//
Функция ЧасыПоДлительностиВСекундах(Секунды) Экспорт
	
	Возврат Окр(Секунды / 3600, 1, РежимОкругления.Окр15как20);
	
КонецФункции

#КонецОбласти
